Revit 2027 API
BuiltInFailures.StructuralCustomConnectionFailures.StructuralCustomConnectionEmpty Property
 Structural Custom Connection cannot be empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralCustomConnectionEmpty { get; }
Public Shared ReadOnly Property StructuralCustomConnectionEmpty As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralCustomConnectionEmpty {
	FailureDefinitionId^ get ();
}
static member StructuralCustomConnectionEmpty : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralCustomConnectionFailures Class
Autodesk.Revit.DB Namespace